{"data":
  {
    "bgImage": "http://travelchannel.sndimg.com/content/dam/images/travel/fullset/2015/06/11/nj-best-beaches/point-pleasant-beach-boardwalk-new-jersey.jpg.rend.tccom.1280.960.jpeg",
    "highlights":[
      {"id":"1",
        "site":"Absecon Lighthouse",
        "category":"Museum",
        "info": "Absecon Lighthouse was first lit on January 15, 1857.  It is the tallest lighthouse in New Jersey and is on the National Register of Historic Places, the Historic American Buildings Survey, and the New Jersey Register of Historic Places.  It is located in Atlantic City and overlooks Absecon Inlet.",
        "lat": "39.3662566",
        "long": "-74.4164845",
        "image": "http://i.imgur.com/iHtV9ir.jpg",
        "video": "https://www.youtube.com/?watchv=QauZpcP6Tz0",
        "videoEmbed": "https://www.youtube.com/embed/QauZpcP6Tz0"
      },
      {"id":"2",
        "site":"Thomas Edison National Historical Park",
        "category":"National Park",
        "info": "Explore the life and work of Thomas Edison at this US National Park located on Main Street in West Orange.  Visitors can tour Glenmont, Edison's home.  The house has 29 rooms, as well as several other buildings, including a barn and a greenhouse.  Visitors can also see Edison's laboratory and some of the materials associated with the creation of the phonograph and early lightbulbs.",
        "lat": "40.7841361",
        "long": "-74.2332214",
        "image": "http://i.imgur.com/5N1LDVr.jpg",
        "video": "https://www.youtube.com/watch?v=T4BC65u_4UM",
        "videoEmbed": "https://www.youtube.com/embed/T4BC65u_4UM"
      },
      {"id":"3",
        "site":"Battleship New Jersey",
        "category":"Museum",
        "info": "Tour the Battleship New Jersey, the most decorated battleship in the history of the United States Navy.  The USS New Jersey served in World War II, Korea, and Vietnam.  The ship now acts as a museum located in Camden.  Visitors can tour the ship, and groups can even stay overnight.",
        "lat": "39.9394484",
        "long": "-75.1330734",
        "image": "http://i.imgur.com/HkgNxtd.jpg",
        "video": "https://www.youtube.com/watch?v=i4dnmfCa0is",
        "videoEmbed": "https://www.youtube.com/embed/i4dnmfCa0is"
      },
      {"id":"4",
        "site":"Ellis Island",
        "category":"Museum",
        "info": "From 1892 until 1954, Ellis Island operated as a destination point for immigrants to the United States.  Over 12 million immigrants passed through Ellis Island in that time, and it is now a US National Monument, a New York City Landmark, and on the US National Register of Historic Places, as well as the New Jersey Register of Historic Places.  For many years it was debated whether Ellis Island belonged to New York or New Jersey, but in 1998 the US Supreme Court ruled that 90% of Ellis Island belonged to New Jersey.  Visitors can tour Ellis Island after taking off from Jersey City.",
        "lat": "40.7082127",
        "long": "-74.0382124",
        "image": "http://i.imgur.com/5gzzLDT.jpg",
        "video": "https://www.youtube.com/watch?v=HGkqh-iwS28",
        "videoEmbed": "https://www.youtube.com/embed/HGkqh-iwS28"
      },
      {"id":"5",
        "site":"Liberty Science Center",
        "category":"Activities",
        "info": "Liberty Science Center, located in Jersey City, boasts 12 exhibition halls, a live animal collection, aquariums, a 3D theater, and the world's biggest IMAX Dome Theater, as well as classrooms and labs.  The LSC offers activities for people of all ages, as well as educational programs for students and teachers.",
        "lat": "40.7082359",
        "long": "-74.0547097",
        "image": "http://i.imgur.com/shCTDgZ.jpg",
        "video": "https://www.youtube.com/watch?v=0YEsIS5oUag",
        "videoEmbed": "https://www.youtube.com/embed/0YEsIS5oUag"

      },
      {"id":"6",
        "site":"Morristown National Historical Park",
        "category":"National Park",
        "info": "Morristown National Historical Park commemorates the legacy of George Washington and the American Revolution.  Washington and his troops camped in Morristown from December 1779 until June 1780, and the 1779-1780 winter was the coldest of the American Revolution.  The park maintains museums, and visitors can hike through Jockey Hollow and the Revolutionary War Winter Encampment.  The park is also part of the larger Washington-Rochambeau Revolutionary Route National Historic Trail, which runs from Virginia to Massachusetts and commemorates the joining of the Continental Army and the French Army, which was under the command of General Rochambeau.  The trail runs almost 700 miles, marking the largest troop movement of the American Revolution.",
        "lat": "40.7970923",
        "long": "-74.4659376",
        "image": "http://i.imgur.com/tCHynvv.jpg",
        "video": "https://www.youtube.com/watch?v=EdfWgCyqUWE",
        "videoEmbed": "https://www.youtube.com/embed/EdfWgCyqUWE"
      },
      {"id":"7",
        "site":"Steel Pier",
        "category":"Activities",
        "info": "The Steel Pier, located in Atlantic City, opened on June 18, 1898.  The pier provided entertainment in the form of dance bands, movie theaters, exhibits, stunts, and shows.  John Philip Sousa even played a series of annual concerts at the pier.  Miss America was crowned at the Steel Pier from 1935-1938, and Frank Sinatra and Diana Ross and The Supremes performed at the pier.  Today, the Steel Pier is an amusement park with rides, arcade games, and food.",
        "lat": "39.357409",
        "long": "-74.41896",
        "image": "http://i.imgur.com/1F2dZuB.jpg",
        "video": "https://www.youtube.com/watch?v=YbN9nwrAbFs",
        "videoEmbed": "https://www.youtube.com/embed/YbN9nwrAbFs"
      }
    ]
  }
}
